howto/howto-solve-simple-problem-in-clojure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>One way to solve a problem in clojure</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="One way to solve a problem in clojure"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-24 14:48:56 CEST"/>
<meta name="author" content="Antoine R. Dumont"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">One way to solve a problem in clojure</h1>

<p>In this article, we will see how to use the different tools at our disposal to solve a problem.
</p>
<p>
<b>Notes</b>
</p><ul>
<li>Clojure is in no way limited to simple problems.
</li>
<li>The problem is <b>not</b> an <b>impressive one</b> as i want to focus on how to start a clojure project and how to use the tools.
</li>
</ul>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Pre-requisites</a>
<ul>
<li><a href="#sec-1-1">1.1 emacs</a></li>
<li><a href="#sec-1-2">1.2 clojure environment setup</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Problem</a></li>
<li><a href="#sec-3">3 To the solution in Top Down TDD</a>
<ul>
<li><a href="#sec-3-1">3.1 First fact</a></li>
<li><a href="#sec-3-2">3.2 Compilation problem</a></li>
<li><a href="#sec-3-3">3.3 Compilation ok, fact KO</a></li>
<li><a href="#sec-3-4">3.4 Top Down Test Driven Development</a></li>
<li><a href="#sec-3-5">3.5 First implementation, compilation ok, fact ok</a></li>
<li><a href="#sec-3-6">3.6 <code>mx</code> facts</a></li>
<li><a href="#sec-3-7">3.7 Final - Integration test</a></li>
<li><a href="#sec-3-8">3.8 Code</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Conclusion</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Pre-requisites</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <a href="http://adumont.fr/blog/how-to-install-emacs-24/">emacs</a></h3>
<div class="outline-text-3" id="text-1-1">

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> <a href="http://adumont.fr/blog/how-to-boostrap-a-clojure-project/">clojure environment setup</a></h3>
<div class="outline-text-3" id="text-1-2">

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Problem</h2>
<div class="outline-text-2" id="text-2">

<p>Now to prove that we have all that we need, we will solve a little problem.
</p>
<p>
<code>Write a function which takes a variable number of parameters and returns the maximum value.</code>
</p>
<p>
<b>Note</b> There is already a <code>max</code> function but we will forbid ourselves to use it.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> To the solution in Top Down TDD</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> First fact</h3>
<div class="outline-text-3" id="text-3-1">

<p>Let's design some facts to help us progress.
</p>


<pre class="example">(fact 
  (our-max 1 8 30) =&gt; 30)
</pre>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Compilation problem</h3>
<div class="outline-text-3" id="text-3-2">

<p>Compilation : <code>C-c C-k</code>
</p>
<p>
Here we will have a compilation problem as there is no function <code>our-max</code>
</p>
<p>
So add this before the fact:
</p>


<pre class="example">(defn our-max "Given an infinite list of int parameters, compute the max of all the input integers."
  [&amp; l])

(fact (our-max 1 8 30) =&gt; 30)
</pre>


<p>
<b>Explanations</b>
The declaration of the function:
</p><ul>
<li>is declared with <code>defn</code>
</li>
<li>followed by the name of the function we want, here <code>our-max</code>
</li>
<li>then a doc-string to explicit what the function does
</li>
<li>the vector of arguments (in square-brackets as all the vectors). The <code>&amp; l</code> means that the arguments is an indefinite number of parameters, that's exactly what we want!
</li>
<li>and at last the body of the function (the implementation), here we did nothing.
</li>
</ul>


</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Compilation ok, fact KO</h3>
<div class="outline-text-3" id="text-3-3">

<p>Launch the compilation <code>C-c C-k</code>.
Now, the compilation is ok, but we got fail facts.
That's ok because, with no implementation, we got a nil result.
</p>



<pre class="example">;.;. [31mFAIL[0m at (NO_SOURCE_FILE:1)
;.;.     Expected: 30
;.;.       Actual: nil
(fact (our-max 1 8 30) =&gt; 30)
</pre>


<p>
We expected 30 but got nil.
</p>
<p>
<b>Note</b>
In clojure, a function always return something and in case of no implementation, we return nil.
</p>
</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Top Down Test Driven Development</h3>
<div class="outline-text-3" id="text-3-4">

<p>We will try a Top Down TDD approach, i.e. we will make the function work but based on mock implementations of sub functions.
And as soon as we have the top level done, we can develop the sub function we depend on.
</p>
<p>
So here, we can change the fact to depend on a <code>mx</code> function (really a <code>max</code> function) which computes the max between 2 integers.
</p>


<pre class="example">(unfinished mx)

(defn our-max "Our max implementation function"
  [&amp; l])

(fact
  (our-max 1 8 30) =&gt; 30
  (provided
    (mx 1 8) =&gt; 1
    (mx 1 30) =&gt; 30)
</pre>


<p>
<b>explanations</b>
</p>
<ul>
<li>The <code>(unfinished list)</code> is here to tell midje, it's ok that you do not have the implementation yet. Do not fail the compilation for such a small detail.

</li>
<li>We mock the call of a new function <code>mx</code> with the parameters <code>1 8</code> and with the <code>1 30</code>.

</li>
<li>I voluntarily tell midje that the max between 1 and 8 is 1 for everybody to see that this is a mock implementation and
  in no way the reality.
</li>
</ul>


<p>
By compiling this fact, Midje enriches its message for us:
</p>


<pre class="example">;.;. [31mFAIL[0m at (NO_SOURCE_FILE:1)
;.;. You claimed the following was needed, but it was never used:
;.;.     (mx 1 8)
;.;. 
;.;. [31mFAIL[0m at (NO_SOURCE_FILE:1)
;.;. You claimed the following was needed, but it was never used:
;.;.     (mx 1 30)
;.;. 
;.;. [31mFAIL[0m at (NO_SOURCE_FILE:1)
;.;.     Expected: 30
(fact
  (our-max 1 8 30) =&gt; 30
  (provided
    (mx 1 8) =&gt; 1
    (mx 1 30) =&gt; 30))
</pre>


<p>
Basically, midje warns us about the absence of the <code>mx</code> call in our implementation.
Indeed, we did not yet complete our implementation.
</p>
<p>
<b>Note</b>
</p><ul>
<li>To add a not implemented function into the <code>unfinished list</code>, hit <code>C-c u</code>
</li>
</ul>


</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> First implementation, compilation ok, fact ok</h3>
<div class="outline-text-3" id="text-3-5">


<p>
The way i see it is this, we want to <code>reduce</code> a list of elements to the max of its elements.
The function that does such a transformation is the <code>reduce</code> function.
</p>
<p>
In the repl, type <code>reduce</code> then <code>C-c C-d d</code>, this will open a browser with the documentation on this function.
</p>


<pre class="example">clojure.core/reduce
([f coll] [f val coll])
  f should be a function of 2 arguments. If val is not supplied,
  returns the result of applying f to the first 2 items in coll, then
  applying f to that result and the 3rd item, etc. If coll contains no
  items, f must accept no arguments as well, and reduce returns the
  result of calling f with no arguments.  If coll has only 1 item, it
  is returned and f is not called.  If val is supplied, returns the
  result of applying f to val and the first item in coll, then
  applying f to that result and the 2nd item, etc. If coll contains no
  items, returns val and f is not called.
</pre>


<p>
This indeed is exactly what we want with <code>mx</code> as our <code>f</code> function and <code>l</code> our <code>coll</code>.
So here comes our implementation:
</p>


<pre class="example">(defn our-max "Our max implementation function"
  [&amp; l]
  (reduce mx l))

;.;. Happiness comes when you believe that you have done something truly meaningful. -- Yan
(fact
  (our-max 1 8 30) =&gt; 30
  (provided
    (mx 1 8) =&gt; 1
    (mx 1 30) =&gt; 30)
</pre>


<p>
And this work!
</p>
<p>
<b>Explanations</b>
We want to compute the max in a list of integers, so we use <code>reduce</code> to loop over the elements and compute the max.
The detailed step:
</p><ul>
<li><code>(mx 1 8)</code> will give 1 according to the contract
</li>
</ul>




<pre class="example">(provided (mx 1 8) =&gt; 1)
</pre>

<ul>
<li><code>(mx 1 30)</code> will give 30 according to the contract
</li>
</ul>




<pre class="example">(provided (mx 1 30) =&gt; 30)
</pre>

<ul>
<li>and that's it. The result is then <code>30</code> which indeed is what we expect.
</li>
</ul>


<p>
So the fact is ok!
</p>
<p>
Next step: implement the <code>mx</code> function.
</p>
</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> <code>mx</code> facts</h3>
<div class="outline-text-3" id="text-3-6">

<p>It's just a max function, so here goes the facts:
</p>


<pre class="example">(unfinished )

(defn mx "max"
  [x y]
  (if (&lt; x y) y x))

;.;. Without work, all life goes rotten. -- Camus
(fact "mx"
  (mx 1 2) =&gt; 2
  (mx 2 100) =&gt; 100)
</pre>


<p>
<b>Note</b>
The arity of the function (number of arguments) needed was 2 as we described in the first fact (our-max).
</p></div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Final - Integration test</h3>
<div class="outline-text-3" id="text-3-7">

<p>Now that we think we have everything, let's check it with a real fact (that is without mock).
</p>
<p>
For example, add this fact at the bottom of the file.
</p>


<pre class="example">;.;. Out of clutter find simplicity; from discord find harmony; in the middle of difficulty lies opportunity. -- Einstein
(fact
  (our-max 9786 4 7 87 9999 876 342 9876 999) =&gt; 9999)
</pre>


<p>
Ok!
</p>
</div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> Code</h3>
<div class="outline-text-3" id="text-3-8">

<p>Here is the final <code>core.clj</code> file.
</p>


<pre class="example">(ns hello.core
  (:use [midje.sweet]))

;; Write a function which takes a variable number of parameters and returns the maximum value.

(unfinished )

(defn mx "max"
  [x y]
  (if (&lt; x y) y x))

(fact "mx"
  (mx 1 2) =&gt; 2
  (mx 2 100) =&gt; 100)

(defn our-max "Our max implementation function"
  [&amp; l]
  (reduce mx l))

(fact "mock our-max"
  (our-max 1 8 30) =&gt; 30
  (provided
    (mx 1 8) =&gt; 1
    (mx 1 30) =&gt; 30))

;.;. Out of clutter find simplicity; from discord find harmony; in the middle of difficulty lies opportunity. -- Einstein
(fact "ITest our-max"
  (our-max 9786 4 7 87 9999 876 342 9876 999) =&gt; 9999)
</pre>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Conclusion</h2>
<div class="outline-text-2" id="text-4">

<p>With these posts and this one,
</p><ul>
<li><a href="http://adumont.fr/blog/how-to-install-emacs-24/">http://adumont.fr/blog/how-to-install-emacs-24/</a>
</li>
<li><a href="http://adumont.fr/blog/how-to-install-the-clojure-development-environment/">http://adumont.fr/blog/how-to-install-the-clojure-development-environment/</a>
</li>
<li><a href="http://adumont.fr/blog/how-to-boostrap-a-clojure-project/">http://adumont.fr/blog/how-to-boostrap-a-clojure-project/</a>
</li>
</ul>


<p>
You now have all you need to develop with clojure.
</p>
<p>
For documentation about the different tool i used, i recommend reading the README on each github project which are really well explained.
</p>
<p>
Also, if you have some time, there is a good <a href="http://vimeo.com/19404746">video</a> from <a href="http://www.exampler.com/about.html">Brian Marick himself</a> (midje's creator)
using top down tdd to solve a more complex problem than this one.
</p>
<p>
In a near future, i intend to make some other blog posts to focus on:
</p><ul>
<li>continued integration with <a href="http://about.travis-ci.org/docs/user/getting-started/">travis-ci</a>
</li>
<li><a href="http://www.heroku.com/">heroku</a> for the deploying part
</li>
<li><a href="https://github.com/fogus/marginalia">marginalia</a> for the documentation generation and the <a href="#github">github</a> integration.
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-24 14:48:56 CEST</p>
<p class="author">Author: Antoine R. Dumont</p>
<p class="creator">Org version 7.8.08 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
